PRACTICA 35

In [94]:
import numpy as np
import pandas as pd

# Ventas en mil millones de dólares de las diferentes compañias fabricantes de Hardware entre los años 2016 - 2019

my_data = {
    'Año': [2016, 2017, 2018, 2019],
    'AMD': [4.27, 5.33, 6.48, 6.73],
    'Intel': [59.39, 62.76, 70.85, 71.97],
    'Samsung': [175, 215, 218, 197],
    'Seagate': [11.16, 10.77, 11.20, 10.51]
}

my_dataFrame = pd.DataFrame(my_data)

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"], index=[0, 1, 2, 3, 4, 5])

populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}





pop_prov_Cuba = {"Pinar del Río": {2018: 583000, 2019: 585000, 2020: 587000, 2021: 589000,2022: 591000, 2023: 593000,}, "Artemisa": {2018: 513000, 2019: 515000, 2020: 517000, 2021: 519000,2022: 521000, 2023: 523000,},"La Habana": {2018: 2110000, 2019: 2120000, 2020: 2130000, 2021: 2140000,2022: 2150000, 2023: 2160000,}, \
    "Mayabeque": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,},"Matanzas": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Cienfuegos": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, \
    "Villa Clara": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Santi Spíritu": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Ciego de Ávila": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, \
    "Camaguey": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Las Tunas": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Holguín": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, \
    "Gramma": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Santiago de Cuba": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}, "Guantánamo": {2018: , 2019: , 2020: , 2021: ,2022: , 2023: ,}}  

frame3 = pd.DataFrame(populations)

In [109]:
import pandas as pd

dataCuba = {
    'Provincia': ['Pinar del Río', 'Artemisa', 'La Habana', 'Mayabeque', 'Matanzas', 'Cienfuegos', 'Villa Clara', 'Sancti Spíritus', 'Ciego de Ávila', 'Camagüey', 'Las Tunas', 'Holguín', 'Granma', 'Santiago de Cuba', 'Guantánamo', 'Isla de la Juventud'],
    '2018': [583000, 513000, 2110000, 381000, 716000, 408000, 779000, 462000, 431000, 765000, 536000, 1032000, 838000, 1043000, 511000, 83000],
    '2019': [585000, 515000, 2120000, 383000, 718000, 409000, 780000, 463000, 432000, 766000, 537000, 1033000, 839000, 1044000, 512000, 84000],
    '2020': [587000, 517000, 2130000, 385000, 720000, 410000, 781000, 464000, 433000, 767000, 538000, 1034000, 840000, 1045000, 513000, 85000],
    '2021': [589000, 519000, 2140000, 387000, 722000, 411000, 782000, 465000, 434000, 768000, 539000, 1035000, 841000, 1046000, 514000, 86000],
    '2022': [591000, 521000, 2150000, 389000, 724000, 412000, 783000, 466000, 435000, 769000, 540000, 1036000, 842000, 1047000, 515000, 87000],
    '2023': [593000, 523000, 2160000, 391000, 726000, 413000, 784000, 467000, 436000, 770000, 541000, 1037000, 843000, 1048000, 516000, 88000]
}

df = pd.DataFrame(dataCuba)

print(df)

              Provincia     2018     2019     2020     2021     2022     2023
0         Pinar del Río   583000   585000   587000   589000   591000   593000
1              Artemisa   513000   515000   517000   519000   521000   523000
2             La Habana  2110000  2120000  2130000  2140000  2150000  2160000
3             Mayabeque   381000   383000   385000   387000   389000   391000
4              Matanzas   716000   718000   720000   722000   724000   726000
5            Cienfuegos   408000   409000   410000   411000   412000   413000
6           Villa Clara   779000   780000   781000   782000   783000   784000
7       Sancti Spíritus   462000   463000   464000   465000   466000   467000
8        Ciego de Ávila   431000   432000   433000   434000   435000   436000
9              Camagüey   765000   766000   767000   768000   769000   770000
10            Las Tunas   536000   537000   538000   539000   540000   541000
11              Holguín  1032000  1033000  1034000  1035000  1036000  1037000
12               Granma   838000   839000   840000   841000   842000   843000
13     Santiago de Cuba  1043000  1044000  1045000  1046000  1047000  1048000
14           Guantánamo   511000   512000   513000   514000   515000   516000
15  Isla de la Juventud    83000    84000    85000    86000    87000    88000

In [77]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [95]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [96]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [79]:
import pandas as pd


my_dataFrame

    Año   AMD  Intel  Samsung  Seagate
0  2016  4.27  59.39      175    11.16
1  2017  5.33  62.76      215    10.77
2  2018  6.48  70.85      218    11.20
3  2019  6.73  71.97      197    10.51

loc: Se basa en etiquetas (nombres asignados a filas y columnas). Puedes usar etiquetas personalizadas o nombres de índice para acceder a los datos.

Ejemplos:

In [ ]:
df.loc[0] #Selecciona la fila con etiqueta 0.
df.loc['Etiqueta_o_nombre_fila'] #Selecciona la fila con el nombre de la fila o
etiqueta.
df.loc[:, 'Nombre_Columna'] #Selecciona una columna por su nombre.

In [2]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

Las columnas pueden modificarse por asignación. Por ejemplo, a la columna debt vacía se le puede asignar un valor escalar o un array de valores:

In [97]:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

Cuando asigne listas o arrays a una columna, la longitud del valor debe coincidir con la longitud del DataFrame. Si asigna una Series , sus etiquetas se realinearán exactamente
con el índice del DataFrame, insertando los valores que falten en cualquier valor del índice que no esté presente:

In [98]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [99]:
my_dataFrame["Activo"] = True
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo
0  2016  4.27  59.39      175    11.16    True
1  2017  5.33  62.76      215    10.77    True
2  2018  6.48  70.85      218    11.20    True
3  2019  6.73  71.97      197    10.51    True

In [100]:
val = pd.Series([249.82, 293.86, 306.53, 286.21], index=[0, 1, 2, 3])
my_dataFrame["Ventas_totales"] = val
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo  Ventas_totales
0  2016  4.27  59.39      175    11.16    True          249.82
1  2017  5.33  62.76      215    10.77    True          293.86
2  2018  6.48  70.85      218    11.20    True          306.53
3  2019  6.73  71.97      197    10.51    True          286.21

Al asignar una columna que no existe se creará una columna nueva. La palabra clave 'del' borrará columnas como con un diccionario. Como ejemplo, primero se añade una nueva
columna de valores booleanos donde la columna state es igual a "Ohio" :

In [5]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [101]:
my_dataFrame["Mayor_300"] = my_dataFrame["Ventas_totales"] > 300
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo  Ventas_totales  Mayor_300
0  2016  4.27  59.39      175    11.16    True          249.82      False
1  2017  5.33  62.76      215    10.77    True          293.86      False
2  2018  6.48  70.85      218    11.20    True          306.53       True
3  2019  6.73  71.97      197    10.51    True          286.21      False

El método 'del' se puede utilizar para eliminar esta columna:

In [6]:
del frame2["eastern"]

In [ ]:
del my_dataFrame["Mayor_300"]

In [106]:
my_dataFrame

    Año   AMD  Intel  Samsung  Seagate  Activo  Ventas_totales
0  2016  4.27  59.39      175    11.16    True          249.82
1  2017  5.33  62.76      215    10.77    True          293.86
2  2018  6.48  70.85      218    11.20    True          306.53
3  2019  6.73  71.97      197    10.51    True          286.21

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [104]:
my_dataFrame.columns

Index(['Año', 'AMD', 'Intel', 'Samsung', 'Seagate', 'Activo',
       'Ventas_totales'],
      dtype='object')

In [8]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [9]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Otra forma común de datos es un diccionario anidado de diccionarios:

In [10]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

Si el diccionario anidado se pasa al DataFrame, pandas interpretará las claves externas del diccionario como las columnas, y las claves internas como los índices de fila:

In [27]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

Puede transponer el DataFrame (intercambiar filas y columnas) con una sintaxis similar a la de un array NumPy:

In [12]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [13]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

Las claves de los diccionarios internos se combinan para formar el índice del resultado. Esto no es cierto si se especifica un índice explícito:

In [14]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

Los diccionarios de Series reciben un tratamiento muy similar

In [17]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [29]:
pdata = {"Ohio": frame3["Ohio"][:-1],"Nevada": frame3["Nevada"][:2]}
# frame3["Ohio"][:-1]: Extrae todos los valores de la columna “Ohio”
# excepto el último valor.
# frame3["Nevada"][:2]:Extrae los primeros dos valores de la columna “Nevada”
# en el DataFrame frame3.
print(pdata)

{'Ohio': 2000    1.5
2001    1.7
Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
2001    2.4
Name: Nevada, dtype: float64}

In [30]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

Posibles entradas de datos para el constructor DataFrame

Si el índice y las columnas de un DataFrame tienen definidos atributos de nombre, éstos también se mostrarán:

In [31]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [32]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

A diferencia de Series , DataFrame no tiene atributo name. El método to_numpy de DataFrame devuelve los datos contenidos en el DataFrame como un ndarray bidimensional:

In [33]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

Si las columnas del DataFrame son de diferentes tipos de datos, el tipo de datos del array devuelto se elegirá para acomodar todas las columnas, veamos lo que contiene frame2:

In [23]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [24]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

OBJETOS INDICES

Los objetos Index de pandas son responsables de mantener las etiquetas de los ejes (incluyendo los nombres de las columnas de un DataFrame) y otros metadatos (como el
nombre o nombres de los ejes). Cualquier array u otra secuencia de etiquetas que se utilice al construir una Series o DataFrame se convierte internamente en un Índice:

In [34]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int64

In [35]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [37]:
index[1:]

Index(['b', 'c'], dtype='object')

Los objetos índice son inmutables y, por tanto, no pueden ser modificados por el usuario:

In [38]:
index[1] = "d" # TypeError

TypeError: Index does not support mutable operations

La inmutabilidad hace que sea más seguro compartir objetos índice entre estructuras de datos:

In [39]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [40]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [41]:
obj2.index is labels

True

Además de ser similar a un array, un índice también se comporta como un conjunto (set) de tamaño fijo:

In [42]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [43]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [44]:
"Ohio" in frame3.columns

True

In [45]:
2003 in frame3.index

False

A diferencia de los conjuntos ( set() ) de Python, un índice de pandas puede contener etiquetas duplicadas

In [46]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Las selecciones con etiquetas duplicadas tomarán todas las apariciones de esa etiqueta. Cada Índice tiene una serie de métodos y propiedades para la lógica de conjuntos, que
responden a otras preguntas habituales sobre los datos que contiene. Algunas de las más útiles se resumen en:

FUNCIONES ESENCIALES

Esta sección es una guia a través de la mecánica fundamental de la interacción con los datos contenidos en una Serie o DataFrame.

Reindexación (Reindexing)

Un método importante en los objetos pandas es reindex , que significa crear un nuevo objeto con los valores reordenados para alinearlos con el nuevo índice. Consideremos un
ejemplo:

In [47]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Si se llama a reindex en esta Series , los datos se reordenan de acuerdo con el nuevo índice, introduciendo los valores que faltan si alguno de los valores del índice no estaba ya
presente:

In [48]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

En el caso de datos ordenados como series temporales, es posible que desee realizar alguna interpolación o relleno de valores al reindexar. Utilizando un método como ffill , que
rellena los valores hacia delante

In [49]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [50]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

Con DataFrame, reindex puede alterar el índice (de filas), las columnas o ambos. Si sólo se le pasa una secuencia, reindexa las filas del resultado:

In [55]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=["a", "c", "d"],columns=["Ohio", "Texas", "California"]) 
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [56]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [57]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [58]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Como "Ohio" no estaba en los states , los datos de esa columna se eliminan del resultado. Otra forma de hacer reindex en un eje concreto es pasar las nuevas etiquetas de eje como argumento posicional y, a continuación, especificar el eje que se va a reindexar con la palabra clave axis :

In [59]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

En un DataFrame tambien se puede usar loc e iloc , para reindexar, y muchos usuarios prefieren hacerlo siempre de esta manera. Esto sólo funciona si todas las nuevas etiquetas
de índice ya existen en el DataFrame (mientras que reindex insertará los datos que falten para las nuevas etiquetas):

In [60]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [61]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

Eliminar entradas de un eje

Eliminar una o más entradas de un eje es sencillo si ya tienes un array o una lista de índices sin esas entradas, ya que puedes utilizar el método reindex o la indexación basada en
.loc . Como eso puede requerir un poco de lógica el método drop devolverá un nuevo objeto con el valor o valores indicados eliminados de un eje:

In [62]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [63]:
#alvknasñdlvkas´dovl

new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [64]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

Con DataFrame, los valores índice se pueden eliminar de cualquiera de los ejes. Para ilustrar esto, primero crearemos un DataFrame de ejemplo:

In [65]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Si se llama a drop con una secuencia de etiquetas, se eliminarán los valores de las etiquetas de fila (eje 0):

In [66]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

Para eliminar las etiquetas de las columnas, utilice en su lugar la palabra clave columns:

In [67]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

También puede eliminar valores de las columnas pasando axis=1 ( como en NumPy) o axis="columns":

In [68]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [69]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14